<template>
	<view class="content">
		一、我们如何收集和使用您的个人信息
		您理解并同意：

		低碳E站是年轻人的生活方式平台，低碳E站以“Inspire Lives
		分享和发现世界的精彩”为使命，用户可以通过短视频、图文等形式记录生活点滴，分享生活方式，并基于兴趣形成互动。我们将在本政策中依次向您说明每项功能可能收集的个人信息范围、收集目的、收集方式，以及拒绝提供个人信息可能导致的结果。请您知悉，您拒绝提供各项功能实现所必要的对应信息时，仍然可以使用低碳E站App的其他功能。

		我们会遵循正当、合法、必要的原则，出于本政策所述的以下目的，收集和使用您在使用我们服务过程中主动提供或因使用我们产品和/或服务而产生的个人信息。如果我们要将您的个人信息用于本政策未载明的其它用途，或基于特定目的将已经收集的信息用于其他目的，我们将以合理的方式向您告知，并在使用前再次征得您的同意。您可通过【我-设置-个人信息收集清单】查看详情。

		1.账号注册及登录

		1.1.当您注册及登录时，如您使用一键登录的功能，基于我们与通信运营商的合作，我们会收集您的【手机号码和网络运营商信息】，以便为您提供快捷的登录服务；同时，为帮助您完成注册过程，我们还将收集您的【性别】、【兴趣】和【年龄】，以为您提供低碳E站初始服务。如不希望提供，您可以在收集页面右上角点击【...】-【跳过此步骤】。

		1.2.如您使用第三方账号进行登录，为了满足网络实名制要求，在您使用发布、评论及其他要求实名认证的功能与服务前，我们将另行收集您的手机号码以完成实名认证。请您谨慎考虑后提供这类信息，若您拒绝提供，您可能无法正常使用相应的功能。

		1.3. 您还可以根据自身需求选择填写或更改头像、名字、性别、生日、职业、地区、学校、简介、穿搭信息来完善您的信息，但如您不提供此类信息，不会影响您使用本产品和相关服务。

		1.4. 如果您成功注册低碳E站账号，我们会在低碳E站应用程序及网站中显示您的名字、头像、地区、简介信息。

		2.向您提供产品和/或服务

		2.1.信息浏览、发布、点赞、收藏、分享功能

		2.1.1.为了向您提供我们最核心的信息展示服务并向您推荐可能感兴趣的笔记及相关信息，我们会收集您填写个人资料、您的性别、生日、浏览记录（您的关注、浏览）和点击操作记录（兴趣、点击、搜索、点赞、收藏、分享、评论、发布记录及有关行为）。若您希望关闭我们基于有关信息向您进行的推荐，您可参照本政策2.14条进行操作。

		2.1.2.当您使用发布、编辑内容功能时，我们会请求您授权存储（相册、媒体和其他文件）、相机（摄像头）、麦克风（录音）权限。您如果拒绝授权提供，将无法使用相应功能，但不影响您正常使用低碳E站的其他功能。

		为了提升视频的上传速度、丰富发布功能和优化体验，在您点击“发布笔记”前，我们会将您编辑的视频临时加载至服务器。如果您退出编辑页面、或者因其他原因未发布笔记，我们会立即删除相关视频。您可通过【我-设置-通用设置-不允许发布时提前上传视频】关闭此功能。

		在您发布笔记、直播等互动内容时，我们会使用您授权的地理位置信息判断您发布内容时所在的地理位置，并在后续使用该信息将您发布的内容推荐给其他用户。

		在您同意的情况下，我们将根据您开启直播时的位置信息，将您直播间链接等直播信息在附近功能的地图界面展示给用户，方便与您在同意地理区域的用户发现和访问您的直播间。请您注意，为了保护您的隐私，地图精度过高的情况下，我们将不会在地图上展示您的直播信息。您可以通过预直播页面的设置
		- 地理位置 - 隐藏我的地理位置撤回您的同意。

		2.1.3.当您使用发布、评论、点赞、收藏、分享功能时，您发布的文字、照片、视频、音频、评论、点赞、收藏、分享记录信息会存储在我们的服务器中，因为存储是实现这一功能所必需的。我们会以加密的方式存储，您也可以随时删除这些信息。

		2.1.4
		如您拍摄或者编辑内容时使用地理位置贴纸，经您授权，我们会使用您的地理位置信息以生成贴纸。贴纸将在内容中公开展示，如您拒绝地理位置授权，将无法使用该功能，但不影响您使用其他功能。我们也会使用您授权的地理位置信息，在作品发布页面为你推荐可选用的地理位置链接。我们也会在推荐地理位置锚点时使用该图片/视频自带的媒体信息中的位置信息，您可以通过本隐私政策第四条第三款控制该信息的获取。

		2.1.5
		在您开启并使用“限定回忆”功能时，我们会根据拍摄信息（时间、场景和地点）对您设备相册中的图片、视频进行自动分析、筛选，并为您生成视频。为最佳剪辑效果，我们需要在每次生成视频前收集拍摄信息进行分析。我们承诺不会存储任何信息。在您授权开启“限定回忆”功能后，我们仅会在您授权访问的相册范围内进行分析、筛选。您可以通过本隐私政策第四条第三款中提示的路径开启或关闭该功能。

		2.2.安全运行与风控验证。为了保障软件与服务的安全运行，防止您的个人信息被非法获取，更准确地预防欺诈和保护账号安全，我们会主动收集您的设备信息【包括：设备/硬件型号、设备名称、SIM卡序列号（如ICCID）、硬件/设备序列号（SN）、设备唯一标识符（包括：IMEI、IMSI、Android
		ID、IDFA、IDFV、OAID(Harmony
		OS)、OAID(Android)、MEID）】、运行中的进程、存储（相册、媒体和其他文件）、浏览器类型和设置、语言设置、传感器、操作系统、操作系统版本号和应用程序版本、应用列表、网络设备硬件地址（MAC地址）、WLAN-MAC、WLAN接入点（如SSID，BSSID）、IP地址、蓝牙地址、接入网络的方式、网络质量数据、基站、移动网络信息（包括运营商名称）、设备传感器数据（如加速度传感器、线性加速度传感器、重力传感器、陀螺仪传感器）、软件版本号以及软件使用记录信息上传到服务器处理，用于安全风控验证。如您不同意我们收集前述信息，可能无法完成风控验证。请您理解，为动态检测您的账户是否存在异常登录，每次您把低碳E站切换至后台或重新启动程序时，我们可能会再次读取，我们将把读取频次控制在合理范围内。为了维护网络安全、保障良好生态，您的IP地址所对应的归属地域信息将会展示在您的个人资料页、笔记发布页和评论中。境内展示到省(区、市)，境外展示到国家(地区)，信息以网络运营商数据为准。

		2.3.搜索功能。当您使用低碳E站搜索功能时，我们会收集分析您的搜索指令（可能是文本或者图像形式）、阅读记录和访问时间、评论和互动记录。收集此信息可以向您提供您所需要的内容和可能更感兴趣的服务，同时亦可以改进我们的产品和服务。

		2.4.基于地理位置的功能服务
		。当您通过系统授权开启移动设备的定位功能并使用低碳E站基于地理位置提供的相关服务（包括基于地理位置的内容推荐、附近功能以及附近功能地图界面上本地生活信息和互动内容的展示、内容发布时的位置定位、购物编辑收货信息和资料编辑）时，我们会收集和使用您的位置信息以便为您提供上述服务。您可以在移动设备的系统中关闭定位服务停止我们对您所在位置信息的收集，但不影响您正常使用低碳E站的其他功能。我们也仅会基于网络信息（如IP）、或经过你授权的相应地理位置信息对应的城市及/或区县及/或街道向您展示可能相关的内容或服务。

		2.5.互动功能与服务。

		2.5.1.当您关注您感兴趣的账号、进行浏览、评论、点赞、收藏、分享内容时，我们会收集您关注的账号和前述信息，并向您展示您关注账号发布的内容；同时，您点赞或收藏的内容会向您的粉丝展示，您可将收藏的内容设置仅自己可见，可以在【我】-【收藏】-【收藏专辑】中开启仅自己可见。

		2.5.2.当您使用推荐通讯录好友功能或您主动发现好友时，在获得您明示同意后，我们会收集您的通讯录信息，用于向您展示通讯录中的好友，您的好友也能看到您使用低碳E站服务。如果您不希望被推荐，可以在【我】-点击左上角-【设置】-【隐私设置】-【不把我推荐给可能认识的人】中选择关闭。通讯录信息属于个人敏感信息，拒绝提供该信息仅会使您无法使用上述功能，但不影响您正常使用低碳E站及相关服务的其他功能。

		2.5.3.当您购买商品或服务时，如您需要编辑收货信息，我们可能会向您请求通讯录权限，通讯录权限是敏感权限，拒绝提供仅会使您无法通过通讯录编辑收货信息，但不影响其他功能的使用。

		2.5.4.当您选择使用扫码添加好友时，我们可能会向您请求相机（摄像头）权限，相机（摄像头）权限是敏感权限，拒绝提供仅会使您无法通过扫码途径添加好友，不影响其他功能的使用。

		2.5.5. 当您使用群聊功能进行互动交流时，我们会收集与群及群成员相关的信息，并形成群列表。

		2.5.6. 直播间互动

		如果您是发布直播的主播，直播间中将展示您的昵称、头像。同时，您在直播间收到的评论、礼物、点赞，直播间在线人数，直播时长等互动信息和统计数据也将公开展示。

		如果您是观看直播的用户，您的昵称、头像等账号公开信息，以及直播间内互动信息（互动信息包括但不限于评论、礼物、直播间在线状态等）将在直播间内公开展示，同时我们会根据您的互动活跃情况形成直播间内的统计数据（例如榜单、热度等）并公开展示。

		为了向您提供优质的互动服务，您的昵称、头像等账号公开信息及直播间内与主播间的互动信息（如关注、评论、点赞、礼物等）将可能会同步给该主播查看。

		2.6.购买、查询、使用虚拟财产。为了方便您查询虚拟财产，并尽量降低可能存在的风险，【钱包】会记录您的充值、余额与使用情况。

		2.7.身份认证功能及账号找回。

		2.7.1.当您使用身份认证功能申请成为认证用户时，我们可能会收集您的身份信息，包括您的真实姓名、身份证件号码或照片、面部识别信息，用于证实您的个人身份。若您拒绝提供，不会影响低碳E站其他功能的正常使用。

		2.7.2.当您使用账号找回功能时，我们可能会收集您的身份信息，包括您的真实姓名、身份证件号码或照片、面部识别信息，用于证实您的身份，便于您找回低碳E站账号。若您拒绝提供，不会影响低碳E站其他功能的正常使用。

		2.7.3.当您申请开通直播功能时，根据法律法规的要求，我们可能会收集您的身份信息，包括您的真实姓名、身份证件号码或照片、面部识别信息，用于证实您的个人身份。若您拒绝提供，不会影响低碳E站其他功能的正常使用。

		2.7.4.当您申请商品合作功能时，根据法律法规的要求，我们可能会收集您的身份信息，包括您的真实姓名、身份证件号码或照片、面部识别信息，用于证实您的个人身份；为了帮助您顺利完成商品合作，我们可能收集您的手机号或微信号。若您拒绝提供，不会影响低碳E站其他功能的正常使用。

		2.7.5.当您申请品牌合作功能时，为了验证您的个人身份并判断您是否符合使用品牌合作功能的准入条件，我们可能会收集您的真实姓名、身份证件号码或照片、低碳E站账号信息、职业、学历以及收入明细信息。若您拒绝提供，不会影响低碳E站其他功能的正常使用。

		2.8.商品购买功能。您可以在低碳E站商城订购商品/服务。为了帮助您顺利完成交易、保障您的交易安全、查询订单信息、提供物流服务，在您下单交易或为了完成交易时，我们会收集您的交易商品/服务信息、订单号、下单时间、交易金额、支付方式、收货人姓名、地址、联系电话、物流信息。对于部分特殊类型的商品和服务，您还需要提供该商品或服务所必需的其他信息，例如涉及跨境交易时您需要提供您的真实姓名、身份证件号码以及身份证件正反面照片以完成清关。

		2.9.客服和售后服务功能。当您联系我们的客服或提出我们的产品与/或服务的售后申请时，我们系统可能会记录您与客服之间的通讯记录。为了您的账号与系统安全，我们可能需要您提供相关个人信息与您之前提供的个人信息相匹配以验证您的用户身份。验证成功后，我们可能会收集您与我们的沟通信息（账号信息、订单信息、您为了证明相关事实而提供的图片/视频/文字信息及有关信息）、您的联系方式以及您与我们的沟通记录，包括线上沟通记录、电话录音，以便尽快为您解决问题和改进我们的产品与/或服务。同时，我们可能会以电话、短信、站内信及相关方式主动联系您，沟通您在使用我们产品及服务过程中产生的问题。

		为了保证服务的体验、处理服务纠纷，您与客服间的通话信息可能会被录音。有关上述信息的收集和使用规则如下：

		2.9.1.当您使用低碳E站服务与平台或者商家发生纠纷时，我们可调取并使用录音信息作为解决纠纷的参考依据。

		2.9.2.为了向您提供客服和售后服务，我们可能将您的通话录音存储在第三方客服系统中，我们会通过协议约束等方式，确保第三方无法访问您的通话录音；除以下情形外，平台不会将录音提供给任何人（包括通话主、被叫方）：a.有权机关依法定程序调取；b.被录音的一方持司法机关出具的法律文件依法调取。

		2.10.支付功能。您可以在低碳E站购买商品/服务以及低碳E站会员服务。在您使用该功能的过程中可能会需要进行支付，在支付过程中，我们可能会收集您的第三方支付账号（支付宝账号、微信账号、银联账号及有关账号）。

		2.11.信息预填写功能。您在低碳E站平台填写表单或订单信息时，为帮您节省填写时间，我们会根据您注册、购物时向平台提供的姓名、性别（如有）、手机号码、地区（如有）帮您自动填充表单信息。

		2.12.测肤、试妆功能。当您使用低碳E站提供的测肤或试妆功能时，我们可能需要在通过弹窗征得您单独同意后收集您的存储（相册、媒体和其他文件）、相机（摄像头）权限或面部信息以为您提供该项服务。但我们在提供测肤和试妆服务后不会存储您的面部特征信息。若您拒绝提供前述面部特征信息，您将无法体验我们的测肤、试妆功能，但不会影响低碳E站其他功能的正常使用。

		请注意，由于上述面部特征信息直接关系到您的人身和财产安全，因此您在向我们提供时需慎重考虑。我们将仅基于为您提供测肤、试妆服务的目的收集处理您的上述面部特征信息，而个人信息的处理将仅影响您所体验的测肤、试妆功能的结果。

		2.13.为保证您在使用低碳E站平台服务时能够与后台服务器保持即时通信、且您能够及时收到个性化内容推送，我们会i）向您获取及调用您的开机广播权限用于启动低碳E站或其关联公司移动客户端软件，ii）采用第三方消息推送服务为您生成标识ID用于区分您的设备的唯一性，iii）读取手机状态，用于判断低碳E站软件处在前台还是后台，以提升推送服务的时效性。

		2.14.为向您展示个性化的内容，或确保您能获知更为适宜的内容，我们可能会收集在您在低碳E站平台上搜索/播放/展示推荐内容的记录、音视频播放记录，使用您填写的个人资料信息（如性别、年龄、生日）。如您对推送内容不感兴趣或希望减少某些信息推送时，您可以在长按笔记内容，点击“不感兴趣”。您也可选择关闭推送信息，具体可前往【我】-点击左上角-【设置】-【隐私设置】-【个性化选项】关闭个性化推荐机制。

		2.15.为向您提供更便捷、更符合您个性化需求的商品信息展示、搜索及推送服务，在使用本应用时，我们会根据您的设备信息（包括2.2条所述设备信息及应用列表信息）和您使用低碳E站客户端时的浏览使用信息、购买记录，提取您的偏好特征，并基于特征标签产出间接人群画像，用于向您展示、推送信息和可能的商业广告（请您理解，单独的设备信息无法识别特定自然人的身份信息。如果我们将这类非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，除取得您授权或法律法规另有规定外，我们会将该类个人信息做匿名化处理）。请您知悉并同意，我们在运营过程中可能会通过您在使用我们产品或服务的过程中提供的联系方式（电话、邮箱及其他联系方式）向您发送一种或多种的通知，例如消息告知、身份验证、安全验证、用户使用体验调研；我们也可能会以短信、电话的方式，为您提供您可能感兴趣的服务，功能或活动及相关商业性信息。我们努力保障您的浏览体验。如果您不想接受我们给您发送的商业广告，您可通过短信提示回复退订或提供的其他方式进行退订或关闭，也可以直接与我们联系进行退订。

		2.16．在您分享或被分享信息、参加活动情形下，我们需要访问您的剪切板，读取其中包含的口令、分享码、链接，以为您实现跳转、分享、活动联动功能或服务。
	</view>
</template>

<script setup>

</script>

<style lang="scss">
	@import "style.scss";
</style>